graph main_graph (
  %input[INT8, 1x96x96x1], exponents: [-7]
) initializers (
  %onnx::Conv_152[INT8, 1x1x24x144]
  %classifier.2.weight[INT8, 1x1x32x8]
  %classifier.2.bias[INT32, 8]
  %onnx::Conv_173[INT8, 3x3x192x1]
  %onnx::Conv_164[INT8, 3x3x144x1]
  %/layers/layers.0/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_171[INT32, 192]
  %/layers/layers.3/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_156[INT32, 144]
  %/layers/layers.2/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_167[INT8, 1x1x144x32]
  %onnx::Conv_144[INT32, 96]
  %/layers/layers.3/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_147[INT32, 96]
  %onnx::Conv_155[INT8, 3x3x144x1]
  %/layers/layers.2/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_176[INT8, 1x1x192x32]
  %onnx::Conv_165[INT32, 144]
  %/first/first.2/Constant_output_0[INT8, 1]
  %onnx::Conv_150[INT32, 24]
  %onnx::Conv_170[INT8, 1x1x32x192]
  %onnx::Conv_159[INT32, 24]
  %onnx::Conv_174[INT32, 192]
  %/layers/layers.3/conv/conv.5/Constant_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.5/Constant_1_output_0[INT8, 1]
  %/layers/layers.0/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_168[INT32, 32]
  %onnx::Conv_162[INT32, 144]
  %/first/first.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_158[INT8, 1x1x144x24]
  %/layers/layers.0/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_161[INT8, 1x1x24x144]
  %onnx::Conv_177[INT32, 32]
  %onnx::Conv_146[INT8, 3x3x96x1]
  %/layers/layers.1/conv/conv.2/Constant_output_0[INT8, 1]
  %/layers/layers.2/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_141[INT32, 16]
  %/layers/layers.2/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_143[INT8, 1x1x16x96]
  %/layers/layers.1/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.5/Constant_output_0[INT8, 1]
  %/layers/layers.0/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.3/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_153[INT32, 144]
  %onnx::Conv_140[INT8, 3x3x1x16]
  %onnx::Conv_149[INT8, 1x1x96x24]
  %PPQ_Variable_1[FLOAT, 1]
  %PPQ_Variable_2[INT8, 1]
  %PPQ_Variable_4[FLOAT, 1]
  %PPQ_Variable_5[INT8, 1]
) {
  %/first/first.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%input, %onnx::Conv_140, %onnx::Conv_141)
  %/first/first.2/Clip_output_0 = Clip[quant_type = 'S8'](%/first/first.0/Conv_output_0, %/first/first.2/Constant_output_0, %/first/first.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/first/first.2/Clip_output_0, %onnx::Conv_143, %onnx::Conv_144)
  %/layers/layers.0/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.0/Conv_output_0, %/layers/layers.0/conv/conv.2/Constant_output_0, %/layers/layers.0/conv/conv.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 96, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.0/conv/conv.2/Clip_output_0, %onnx::Conv_146, %onnx::Conv_147)
  %/layers/layers.0/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.3/Conv_output_0, %/layers/layers.0/conv/conv.5/Constant_output_0, %/layers/layers.0/conv/conv.5/Constant_1_output_0)
  %/layers/layers.0/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.5/Clip_output_0, %onnx::Conv_149, %onnx::Conv_150)
  %/layers/layers.1/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.6/Conv_output_0, %onnx::Conv_152, %onnx::Conv_153)
  %PPQ_Variable_0 = RequantizeLinear[quant_type = 'F32'](%/layers/layers.0/conv/conv.6/Conv_output_0, %PPQ_Variable_1, %PPQ_Variable_2)
  %/layers/layers.1/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.0/Conv_output_0, %/layers/layers.1/conv/conv.2/Constant_output_0, %/layers/layers.1/conv/conv.2/Constant_1_output_0)
  %/layers/layers.1/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.2/Clip_output_0, %onnx::Conv_155, %onnx::Conv_156)
  %/layers/layers.1/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.3/Conv_output_0, %/layers/layers.1/conv/conv.5/Constant_output_0, %/layers/layers.1/conv/conv.5/Constant_1_output_0)
  %/layers/layers.1/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.5/Clip_output_0, %onnx::Conv_158, %onnx::Conv_159)
  %/layers/layers.1/Add_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_0, %/layers/layers.1/conv/conv.6/Conv_output_0)
  %/layers/layers.2/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/Add_output_0, %onnx::Conv_161, %onnx::Conv_162)
  %/layers/layers.2/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.0/Conv_output_0, %/layers/layers.2/conv/conv.2/Constant_output_0, %/layers/layers.2/conv/conv.2/Constant_1_output_0)
  %/layers/layers.2/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.2/conv/conv.2/Clip_output_0, %onnx::Conv_164, %onnx::Conv_165)
  %/layers/layers.2/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.3/Conv_output_0, %/layers/layers.2/conv/conv.5/Constant_output_0, %/layers/layers.2/conv/conv.5/Constant_1_output_0)
  %/layers/layers.2/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.5/Clip_output_0, %onnx::Conv_167, %onnx::Conv_168)
  %/layers/layers.3/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.6/Conv_output_0, %onnx::Conv_170, %onnx::Conv_171)
  %PPQ_Variable_3 = RequantizeLinear[quant_type = 'F32'](%/layers/layers.2/conv/conv.6/Conv_output_0, %PPQ_Variable_4, %PPQ_Variable_5)
  %/layers/layers.3/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.0/Conv_output_0, %/layers/layers.3/conv/conv.2/Constant_output_0, %/layers/layers.3/conv/conv.2/Constant_1_output_0)
  %/layers/layers.3/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 192, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.2/Clip_output_0, %onnx::Conv_173, %onnx::Conv_174)
  %/layers/layers.3/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.3/Conv_output_0, %/layers/layers.3/conv/conv.5/Constant_output_0, %/layers/layers.3/conv/conv.5/Constant_1_output_0)
  %/layers/layers.3/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.5/Clip_output_0, %onnx::Conv_176, %onnx::Conv_177)
  %/layers/layers.3/Add_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_3, %/layers/layers.3/conv/conv.6/Conv_output_0)
  %/classifier/classifier.0/GlobalAveragePool_output_0 = GlobalAveragePool[quant_type = 'S8'](%/layers/layers.3/Add_output_0)
  %PPQ_Variable_6 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S8'](%/classifier/classifier.0/GlobalAveragePool_output_0)
  %/classifier/classifier.1/Flatten_output_0 = Flatten[axis = 1, quant_type = 'S8'](%PPQ_Variable_6)
  %output = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/classifier/classifier.1/Flatten_output_0, %classifier.2.weight, %classifier.2.bias)
  return %output
}


initializers value:
%onnx::Conv_152, shape: [1, 1, 24, 144], exponents: [-4], docString: layout ==> N16HWC16, 
value: array([  17,    0,   -2,  -15,   -3,  -32,  -26,   26,   41,  -11,   -6,
        -12,    3,  -10,   -4,  -53,    0,   -3,   11,   14,  -15,  -37,
        -21,   19,   -4,    7,   45,   10,    0,   19,   21,   13,  -47,
        -63,  -24,  -18,  -41,  -20,   56,  -38,  -25,   17,   -7,    3,
        -16,    2,  -39,   28,   42,   -6,  -18,   -4,   13,  -37,   38,
          6,  -21,    2,  -22,  -16,    5,   30,  -10,   -6,    0,    9,
        -13,    3,  -25,    2,   47,  -11,  -13,    0,   -2,  -42,   11,
        -26,   45,    1,   17,   16,   13,  -14,    5,   -8,   13,  -31,
         38,  -17,   -4,    1,   26,  -13,   25,   -1,  -18,    0,    3,
          0,    6,  -12,  -10,  -45,   -4,   25,   -4,   39,  -23,   37,
        -13,    9,   15,   -5,  -18,  -46,   -7,    7,  -20,   21,  -15,
          5,  -39,   -4,  -18,    9,  -28,    7,   26,    3,  -31,    9,
          9,   -3,   29,    3,   16,    5,   47,   34,   15,   18,   33,
         20,   15,    3,    3,    5,   20,   -9,  -33,   21,  -39,  -11,
         38,  -17,    7,    1,   -9,    0,  -49,    0,    9,    9,  -43,
          0,   17,   -4,    0,    0,   19,   33,    4,   39,    0,   34,
          1,    8,   63,  -26,  -49,    9,   -4,  -40,    4,   32,  -30,
         16,  -21,   11,    8,   -2,   14,  -17,  -24,   -4,   -1,   16,
         30,   22,   -6,  -24,  -23,   -3,  -13,   21,  -22,   23,    0,
        -11,   13,    7,   -2,   -7,   49,  -39,    2,  -13,   10,    5,
         16,   30,  -12,   13,   20,    0,  -11,    8,  -11,   13,  -35,
         18,   -6,   -3,   -8,  -29,    4,    9,   -6,  -11,   31,   13,
         14,   20,   21,   38,   51,    5,   -2,  -17,   -5,   -7,  -26,
         -7,  -45,   -6,   78,   -6,  -16,  -11,   -2,   23,  -42,    3,
         29,    7,   35,  -13,   -8,   -9,  -24,   10,    8,   -6,  -28,
        -21,  -14,  -28,  -36,   -5,   37,    9,  -24,   -1,  -13,   34,
         -9,  -31,  -18,   -4,  -29,  -16,  -10,  -28,   44,    0,    1,
          9,   43,   14,   34,   -7,  -14,  -39,    7,   -1,    1,   23,
         14,    2,  -46,  -36,    0,    5,  -10,  -12,    5,  -28,    5,
         -7,   -4,   -4,   -6,    2,   49,  -82,    1,   34,   30,  -15,
        -25,   -5,  -18,   -6,   50,    3,  -33,   23,   18,    6,   23,
          2,    5,   18,  -35,  -10,   -6,  -23,   33,   19,  -19,   -1,
          7,   -8,   17,   -9,   19,   -3,  -23,   58,   46,  -20,   12,
          0,  -33,   33,  -21,    2,   -1,  -11,  -16,  -23,   18,   22,
         37,   19,   -8,   -1,    1,  -44,   15,    5,   43,   15,  -26,
         -5,   17,    8,   14,  -16,   17,   20,   -3,   66,   29,  -12,
         -5,  -26,  -17,  -10,  -32,   23,    3,  -32,  -11,  -23,   30,
         11,   -5,    9,  -53,   14,    9,   14,   -3,  -34,   38,   25,
         18,   11,  -14,  -42,   21,    1,    8,  -42,  -21,   18,    2,
        -21,    1,   -4,  -24,  -15,   -3,   35,    6,   28,   -5,  -20,
         -2,  -16,   -1,   24,   -7,   35,    7,   20,   -1,   19,  -24,
         -2,   -6,    3,  -13,   -8,  -25,   10,  -32,   18,   17,   25,
         46,   -8,    1,  -18,   -9,    4,   -4,  -26,    9,   34,  -17,
          2,   30,   20,   13,  -40,    3,    0,    9,   18,    9,    3,
         -8,   12,  -20,   -2,    1,  -25,   -5,  -15,   -1,   18,   -5,
         18,  -20,  -34,   16,  -35,   23,   -6,   11,  -13,   40,   27,
         16,  -14,   -6,    0,    8,  -10,  -34,   41,    9,  -17,   26,
         36,   -3,  -21,   -7,  -16,  -15,  -18,  -30,  -27,  -16,   47,
        -19,  -14,   -8,   12,  -12,    0,   24,   25,   -4,   45,   -7,
         -4,    0,  -14,  -24,  -27,   52,  -14,   10,    7,   13,  -36,
          3,   -4,   15,   32,  -73,  -41,  -24,   -4,  -24,   10,   35,
        -11,  -37,  -37,   20,   42,  -29,  -26,   32,  -38,   21,  -14,
         -1,    9,    6,    6,   12,   -8,   18,   28,   16,   35,    0,
         35,  -14,   -9,  -31,   -1,   -1,  -26,   -9,   -2,   -6,  -10,
        -13,  -20,    2,  -11,  -11,   -4,   -5,   19,    5,   -2,   14,
         -7,    2,    7,   -2,  -36,   15,  -15,    5,   18,  -43,   -1,
         12,  -15,   -3,   18,    5,   -3,   53,  -32,   -9,  -40,   -1,
        -20,   21,   30,   -2,   14,   20,   29,  -15,   14,   13,    2,
          2,  -21,   -1,   -8,    3,  -29,   29,   41,  -31,   16,   22,
          5,    4,    6,   20,    2,   28,   -2,   19,   -4,    8,   18,
          6,   21,  -14,   36,    1,    3,   11,   -5,  -10,    7,  -14,
         23,  -14,   11,    7,  -31,  -37,   -9,    1,   12,    1,    5,
          7,  -23,  -25,    2,  -17,  -13,   13,  -11,    7,   19,   -1,
         28,    4,   15,  -13,    6,  -29,   15,  -13,  -55,   -5,    5,
        -31,   53,    0,  -16,  -20,   -2,   13,   23,  -15,  -21,  -19,
        -12,  -10,  -57,  -16,   -2,  -12,   -9,  -18,   15,    1,    6,
         -4,   19,   -9,  -22,  -32,   10,    4,    5,  -11,    9,    4,
        -24,   21,   -4,   22,   46,    0,  -12,   41,   21,   -8,   20,
          2,   -3,    8,   -4,  -12,  -16,   15,   28,   10,  -24,   -8,
         38,  -10,  -27,    8,  -19,  -33,  -70,   -6,    0,    2,   -1,
         40,   22,  -13,   -9,  -30,  -27,   -6,  -18,   15,  -24,   22,
        -21,  -60,   -1,   42,   29,   38,  -53,  -30,   -5,   -8,    7,
          0,  -55,   12,   26,   -5,  -22,   -4,  -29,    2,   11,  -17,
          3,   42,   11,   22,    2,    0,   69,  -17,   24,  -12,  -10,
        -10,   -5,  -76,  -14,   17,   20,  -19,  -21,  -39,   -3,    0,
          1,  -18,   27,   -1,   13,   24,  -11,   19,    8,  -24,   18,
         81,   10,    1,  -16,   -3,   32,   10,   -1,    0,   27,   -6,
         -5,   21,   16,   -7,   31,  -61,   -4,   -6,  -22,    3,    4,
         -9,    1,   19,    9,   -6,   15,   12,   -4,   -8,   21,  -10,
         -2,    3,   -6,    0,   -7,   11,    1,   -8,   -3,    7,  -17,
         18,  -35,   13,   15,    9,   -3,    8,   16,    0,  -13,   21,
         11,   14,   -4,  -43,   37,   -8,  -26,   43,  -14,   36,   22,
         38,   23,  -31,   67,  -19,   41,  -26,  -23,   22,    4,  -31,
        -26,   27,   15,    4,  -17,   -7,    2,    1,  -18,   -2,  -20,
          6,    0,   16,  -26,   40,  108,  -16,  -12,  -24,  -25,   -7,
        -33,  -24,  -12,  -12,   46,    4,   11,    2,    1,  -14,   40,
          1,   -5,  -49,   16,   15,   -5,    3,   31,    4,   10,   24,
         11,   20,   14,   -2,   25,   37,  -56,   -7,  -42,  -10,    6,
        -11,  -14,  -12,   24,   -5,  -22,   -4,  -15,   -9,    5,  -31,
        -18,   64,   19,   24,    2,   18,   11,    9,   20,   -6,   20,
         12,   -2,   12,  -18,   20,   14,  -68,   12,   -4,   47,    6,
         27,   12,   19,   27,  -21,  -19,   28,  -28,    0,  -14,   -8,
         21,   14,   10,   48,   -5,   -4,   16,   12,   -6,   24,  -64,
         12,  -17,  -32,    4,  -36,   43,    5,   13,   24,    3,   12,
         22,    7,   11,  -13,   24,    6,    4,   18,   20,   52,   14,
          0,  -22,  -17,    4,   17,  -12,   18,   -4,   -5,  -20,   -4,
         10,    0,   13,    2,  -14,  -31,   -4,  -28,   -9,   45,  -11,
         -8,  -45,  -10,    4,  -13,  -23,    4,   -7,   -9,  -10,  -26,
        -32,  -18,  -11,    0,    1,    4,   11,  -20,    4,   14,   43,
         12,   34,   20,   24,   -1,  -36,  -40,    2,  -11,   13,  -27,
         27,   16,   -6,  -35,   -4,    6,   25,   32,   -9,    6,  -24,
         -1,   11,   18,    8,    5,   -2,    4,   15,  -19,  -21,   12,
         41,   42,   -4,   15,    4,   -6,   31,  -14,    9,   -8,    1,
        -25,   -5,    5,   11,   41,   21,   20,   38,   11,    8,  -43,
        -13,  -53,  -31,    4,   -5,  -21,  -27,   -3,   -7,   -6,   -9,
        -11,  -24,   -4,  -23,   -9,   10,   31,   38,    0,   32,  -24,
         -9,   -8,   -7,   -7,   11,  -24,    1,    2,  -16,   23,   16,
         -7,   41,  -51,   12,   -3,  -19,    4,   11,   36,   85,  -14,
          4,  -20,   16,  -13,   -7,  -15,   -7,  -24,   54,   27,    3,
        -31,   12,  -35,  -21,  -19,   37,  -12,  -21,    0,    6,   -3,
        -17,   38,   -8,    0,   28,   -8,  -10,   34,   13,   11,    5,
         35,   -4,    7,    1,  -18,  -18,   -6,    8,   16,   -7,   36,
         20,   18,  -15,   15,   30,   14,  -31,  -13,   14,    4,   19,
         17,    2,  -11,    7,   27,   -2,   16,  -11,    3,   17,   11,
         15,   17,   -4,    9,   -6,  -42,    2,    3,   -4,    7,  -11,
         -3,    8,   -4,  -26,    1,  -50,  -17,    7,    7,  -23,    5,
          0,    1,  -12,   -4,  -30,  -20,   -5,  -27,  -20,  -32,  -36,
         18,  -10,   21,  -14,   -3,   12,   -4,   40,    7,  -15,  -13,
          0,   -1,   16,    2,   21,    5,    2,   -1,   12,   -2,  -24,
        -30,  -11,   10,   22,  -40,   54,    6,   50,  -20,   65,  -29,
        -18,    7,    8,  -16,  -62,    4,  -12,   32,   20,    1,   44,
        -27,  -24,    4,   74,    8,    3,    9,  -13,   46,   -8,   -3,
        -11,   -7,  -11,   -4,   12,    4,    8,   -5,    7,   -1,   -9,
         21,   35,    9,  -43,   -3,  -25,  -21,   -1,    7,    9,  -12,
        -39,   -1,  -18,   15,   11,   -1,   19,   -5,   15,   28,  -27,
          2,   26,    4,  -21,   10,    1,   -7,    6,    6,   18,   -2,
         10,   17,   24,   17,   19,  -24,  -24,  -19,    9,   40,   34,
         11,   20,    9,   17,   -2,   14,  -37,   -9,  -18,  -27,   19,
          6,   11,   12,   28,  -37,  -11,    2,    4,   16,  -25,  -29,
         41,  -20,   -4,    0,   16,   -6,   11,    9,   26,   29,   -5,
        -40,    2,   10,   -2,   11,   34,    5,   11,   19,   -7,  -27,
         33,   21,    2,   -8,    8,   -4,  -22,  -10,   -6,   -5,   20,
          8,   28,   -8,    4,  -10,   -8,   -8,   23,   26,    4,    4,
        -30,   -3,   25,    6,  -34,   -6,  -14,  -13,  -14,    2,  -19,
         -9,  -24,  -16,   13,  -20,   -1,    4,   14,   14,    0,   12,
         -2,    2,   -9,    3,  -19,   -6,   13,   32,    6,    6,    5,
          9,   -5,   -4,   32,  -34,  -26,  -34,    7,    7,    6,   17,
        -27,   -5,  -12,   -8,   15,    3,   33,    5,  -43,  -40,   -6,
         -1,    1,    3,  -32,    0,  -38,    6,    4,   -2,  -23,  -34,
         -1,  -11,    3,   20,   35,   -3,    0,  -21,    6,   -7,    8,
         -9,  -19,  -27,  -15,  -26,    8,   15,  -13,  -15,  -29,   14,
          9,   37,    4,    3,   10,   15,   12,   -2,   -4,  -39,   -1,
        -30,   24,  -34,  -22,  -43,   22,   11,    6,  -21,  -16,    6,
         71,  -53,  -19,    4,  -12,   20,  -22,   74,   12,    0,  -32,
         10,   -4,   34,  -15,  -18,    2,   42,   30,  -40,  -20,   -8,
         -3,   42,  -20,  -13,    9,  -27,  -13,   35,   14,    3,    4,
          2,    5,   29,   27,   22,  -19,   27,   20,  -18,   22,    6,
         -8,  -19,    7,   -2,   -2,  -29,    9,  -12,   17,   18,   38,
         14,  -12,  -13,   -2,   37,  -17,    9,    2,   10,   -1,  -12,
          3,   14,    9,    3,   11,   31,   25,   12,  -26,   17,    9,
        -20,  -17,   -8,  -20,    2,   20,  -68,  -22,   -1,   30,  -62,
         11,  -22,   48,  -35,  -11,   21,  -11,   15,   12,    0,  -13,
         -3,   -3,  -39,  -41,  -19,  -20,   -7,   26,  -17,  -28,   12,
         16,    4,    5,  -22,    8,  -10,    9,  -39,  -41,  -10,    2,
          1,  -30,    7,    6,  -17,  -18,   -1,   -6,   29,   31,    0,
        -24,   15,  -58,    2,   30,   15,    9,   23,   19,  -25,    9,
         23,   17,  -21,  -23,   45,   41,   45,  -14,  -24,   16,    0,
          8,    9,    4,    0,  -17,   23,   19,   56,   16,  -37,   -5,
        -14,  -60,   73,  -33,   15,    7,    7,   -9,  -12,   13,   50,
         34,   28,  -18,   32,  -16,   -3,  -21,   20,  -12,  -17,   -6,
         -6,    5,   29,    3,    2,  -16,   45,  -11,   11,    3,    5,
        -13,  -18,   -4,  -34,   38,  -22,    2,   33,   15,   18,    0,
         23,    7,    9,  -12,  -14,    4,   44,  -39,   -2,  -11,  -26,
         22,    6,   -7,    5,    7,   23,  -12,  -16,   -1,  -18,   18,
        -47,    7,  -56,  -23,    2,   -9,   15,    5,    2,  -18,   22,
        -17,   33,  -14,   13,  -21,    6,   17,   22,  -32,   -5,    1,
        -33,   10,   -5,   -3,    3,   11,   -1,  -28,  -18,   21,  -26,
         22,   17,   39,   12,   -1,  -29,    1,  -22,  -31,   20,    1,
         -1,   -6,   -1,    5,   -9,  -26,  -22,   23,    7,  -15,    2,
         12,   -5,  -52,    7,  -29,    9,    2,   -8,   -3,  -48,    1,
         10,   44,    9,  -19,   22,   -6,  -16,    9,    1,   -2,  -42,
          2,    2,    6,   46,  -10,   -7,    0,   47,   20,   24,   11,
         -7,   -6,  -65,   10,  -81,    4,    5,  -33,   27,   15,   37,
        101,   25,    7,    2,    0,    0,  -27,    6,   63,   -3,  -52,
         12,   19,   15,   21,  -40,   10,   -6,   30,  -29,    5,  -14,
        -12,  -22,  -12,   -7,   -2,   -2,   -4,   -1,  -12,    0,   45,
         20,   -3,  -13,  -40,   -3,   -9,   11,  -22,    4,   18,   29,
          9,    1,   -3,  -13,  -32,   27,    5,  -12,   15,  -16,  -77,
        -46,   55,   17,   -3,   58,    3,   10,  -16,  -12,  -13,   -1,
         26,  -17,    3,   -5,    8,  -16,  -21,    4,   35,  -47,   -9,
         -4,    8,   27,  -21,   25,  -33,   20,   -3,   19,   22,  -16,
          6,  -19,   11,    9,   22,    6,  -14,    4,  -11,   12,   59,
         -1,  -20,    0,    5,    0,   21,  -21,   -1,   32,   17,   14,
          9,   -5,  -18,  -27,   16,   44,   -5,   16,   23,  -22,   27,
        -14,   56,   25,   15,   -1,   26,   -9,    6,  -21,    2,   27,
         19,   -2,   -2,    2,   -6,  -14,  -43,  -43,  -55,   -8,   18,
        -19,  -52,    5,  -45,   34,   15,    2,   43,  -13,   17,  -12,
         -1,   41,   -8,  -14,   42,   -9,   49,   10,   77,  -35,  -16,
         10,   -7,  -62,   -7,    2,  -13,  -71,    0,   16,    8,    6,
         13,    6,   29,  -31,  -20,  -12,  -34,    9,    8,   60,   12,
          3,  -38,   -4,    1,   46,   53,  -11,   37,  -60,   16,  -10,
        -36,   -4,    1,  -24,   59,  -54,    6,    0,   13,  -11,   54,
          0,   21,   -1,   12,   -7,    8,   53,  -12,   13,   -9,  -34,
        -21,   34,  -23,   -1,  -29,    2,    5,  -22,   15,    8,    6,
        -11,   -1,   52,   -2,    5,   16,    4,   -9,  -17,   26,  -14,
        -51,   15,   15,  -11,  -13,   25,   13,  -17,   -4,    9,    5,
         38,   -5,  -13,   11,   17,  -33,    6,   11,   11,   17,  -28,
          4,  -16,    4,  -27,  -25,    4,  -11,  -21,   22,  -20,  -10,
         -9,    2,   -5,    7,    4,    5,   15,  -12,  -28,   36,   25,
          1,   -5,    0,  -18,    8,  -39,    1,   -8,  -32,  -13,   -6,
        -63,   -9,  -17,  -10,   28,   14,  -34,   13,   -1,   20,   18,
         12,    0,   12,  -35,  -25,    6,   14,    4,   32,   -2,    2,
        -16,   35,    8,  -31,    7,   -9,  -11,   -2,   -5,  -14,    5,
          1,    3,   16,    8,   -6,   -6,  -10,   -4,   15,   -7,  -32,
        -11,   17,  -36,    6,  -28,  -19,   34,   -9,    0,   18,   -7,
         77,   18,  -25,    2,    2,   20,    0,   23,   -6,   -6,    4,
         13,    7,   -6,  -24,  -11,  -28,   -8,   21,  -15,   -5,  -19,
         19,  -31,   21,   -3,   48,   47,    0,   41,   40,    0,   34,
        -25, -106,  -29,   -4,  -31,  -41,  -15,   24,  -16,   28,  -37,
          9,  -25,    1,   19,   -4,  -10,   -5,  -10,   14,   21,  -17,
        -31,   25,    4,   -7,  -24,  -10,   14,  -32,   44,    3,  -21,
         -2,    5,   20,   32,    6,  -25,  -25,  -11,    8,  -24,   30,
        -15,   13,  -18,    8,   18,   46,   24,   -3,   24,  -20,  -15,
         23,   33,  -15,   20,  -48,  -17,  -73,   -4,  -45,   23,    7,
        -18,   44,    0,    3,   28,  -25,   19,   36,   35,   -6,    0,
        -27,    2,   28,   -3,    2,  -15,  -20,  -40,    7,   29,   56,
          5,   25,   -5,   16,   20,  -30,  -15,   46,   10,    4,   12,
         -8,   -4,   -3,   22,   10,    3,   11,   64,   21,    4,   -4,
         -2,   30,  -20,   26,    3,   -4,   22,    8,   -4,    6,   16,
         -4,  -20,  -15,    7,  -13,   -5,  -59,   31,    9,   -2,  -15,
          8,   12,   25,   32,   42,    7,  -43,   -4,    3,  -48,  -23,
         13,  -19,   16,   35,    3,    5,   22,   36,    0,  -23,   -4,
         -5,   29,  -19,  -76,  -27,  -45,  -36,    9,   22,   20,   17,
         21,  -38,  -11,  -15,   20,   18,   -5,   14,   48,   11,  -46,
        -51,  -25,  -35,  -23,   -2,  -72,   22,  -73,  -32,   14,   12,
          7,  -40,  102,   47,   36,   76,   37,  -12,  -34,   26,  -37,
        -28,  -46,  -52,   -9,   29,  -64,   15,   33,  -32,    3,  -45,
          4,  -13,   21,   10,    8,   31,   -4,  -30,   -3,  -16,   18,
         -5,  -27,   15,   35,    1,    8,   14,   -7,   23,    5,   28,
        -13,   -5,   12,  -16,   13,    1,   10,    3,   -2,    2,  -46,
         -1,  -44,   14,   -7,   44,  -13,    0,  -16,  -12,  -26,    9,
         23,  -19,  -29,   48,  -44,  -15,    7,  -23,   -5,   60,   78,
         -8,  -27,   15,    9,   18,   25,  -20,  -47,   14,    0,   20,
         12,   22,   -5,   -3,  -11,   44,   -8,  -55,    1,   14,  -31,
         -4,    4,    5,   32,  -20,   -7,   17,   -9,  -48,  -12,  -47,
          4,   35,   -1,    2,  -29,  -21,   12,   11,  -38,   -3,    3,
        -14,   -8,  -41,   -4,    2,   16,   -7,   18,    3,    4,   -8,
          7,    9,  -34,   -3,   23,  -43,  -12,   12,    2,  -14,    1,
         10,  -31,    2,   -3,   15,  -24,   28,    8,  -11,   10,   20,
         24,  -23,   -1,  -32,   21,  -16,  -13,   -7,  -28,  -19,  -23,
        -34,   19,   21,   -2,  -16,  -13,  -23,   14,    2,   21,  -47,
          0,  -13,  -70,    3,    1,  -39,  -30,   -6,   23,    5,    3,
        -24,   44,   14,   24,   -5,   -4,  -22,  -66,   14,  -78,    8,
         15,  -53,   -6,  -48,  -27,    4,  -14,  -74,  -61,   22,   19,
        -48,   41,   32,  -33,  -15,  -37,   -7,   11,   47,  -21,   11,
        -35,   15,    1,   15,    4,   24,  -55,    8,  -40,  -20,  -15,
        -24,  -46,   10,  -21,   25,   40,  -12,   49,   98,   -3,    3,
         39,    8,  -28,   18,   11,   45,  -11,  -28,  -10,   -5,  -20,
        -26,    5,   33,   38,   21,   -3,  -50,  -22,   -3,   -8,  -29,
          7,  -15,    6,   -2,   40,  -25,  -17,   -3,  -51,  -29,   -3,
        -20,  -13,    2,   10,   26,  -15,    2,    2,   -1,  -12,    5,
          6,  -32,   25,   44,   26,   32,  -30,   -4,   12,   30,  -30,
         17,   26,  -13,  -38,    1,  -14,   -7,   30,   11,   18,   15,
         20,   -8,    3,   12,  -22,  -13,   26,  -21,   30,    5,  -13,
        -27,   22,    5,    4,   21,  -21,   24,   -4,  -10,   25,   20,
         -1,   38,   11,  -14,   -6,    5,   21,   -5,   -3,  -22,   32,
         20,  -15,   12,  -62,   -1,   -6,   -1, -108,    1,  -37,   25,
         -7,    1,  -22,   30,   -5,  -13,    7,    6,    0,  -10,   -3,
         37,   -9,    4,    2,   -4,   -9,    7,   -6,   12,  -15,   24,
          4,   42,  -89,   49,  -50,  -22,   82,   -4,   24,   -5,   32,
          7,   -3,   11,  -15,    9,   -9,  -10,  -60,  -26,   15,  -62,
         24,   -5,  -23,   23,  -19,    0,   31,  -17,   -2,    8,  -13,
        -21,   18,    4,  -40,   -5,    6,   -9,   34,   35,  -20,  -21,
        -37,  -12,   11,  -13,    3,  -15,   -1,  -22,  -10,  -13,    9,
         20,   21,    4,   13,    2,    3,    9,    4,   -7,   11,  -20,
         22,  -17,    3,  -17,   46,   14,   23,   15,   16,   12,    4,
        -15,   24,  -21,   27,   18,   20,  -15,  -26,   14,   -3,    9,
          5,  -27,   35,   25,   10,  -19,  -21,   -9,   10,   -6,   38,
          3,    4,   -5,  -33,   10,    4,  -10,    1,  -10,    1,  -19,
          2,  -19,   -1,    9,   -2,   19,    8,   -5,   43,   18,   11,
        -39,   37,    5,   -4,  -15,   22,  -21,  -12,    8,   22,    9,
        -13,    7,  -30,   -9,  -14,   13,    6,    5,   -8,    9,  -61,
          5,  -17,   -8,   42,    7,   -6,   27,   25,   -1,   13,    7,
         10,   -8,    9,    8,    0,   -8,   -1,   14,  -35,   12,  -15,
         34,   19,  -12,  -17,    3,   21,    9,   -3,   25,    4,    3,
         13,    3,   25,  -14,    4,   -2,   22,   25,   11,  -40,   14,
         -2,  -10,    0,  -15,  -13,    6,  -29,   -9,   31,    0,   17,
         21,   -4,   28,   16,   15,   -1,    6,   19,   19,    6,    2,
        -14,  -36,   26,  -22,    3,   52,   -8,   -1,  -53,   27,  -14,
         31,    7,  -33,    2,   -6,   16,   68,   -1,   -5,   52,   -9,
         26,   52,   28,  -46,   -4,   -4,   42,   10,   -8,    9,   14,
         -4,   13,    5,  -31,   -9,  -44,  -17,   15,  -36,   17,    3,
          5,    5,   -5,  -12,   16,  -36,  -13,   -5,  -14,    4,   -1,
        -22,  -12,   19,  -16,   -9,  -19,  -30,   12,   -5,   11,    1,
        -23,   -7,   -7,  -23,    3,    2,  -15,  -27,   -9,   -5,  -20,
        -31,  -26,    6,    4,   11,   16,   18,  -16,   20,    4,    9,
        -40,    1,   -4,    6,    0,   11,   -9,   18,   32,   15,   -4,
        -13,   -6,    0,   33,   14,   -4,   21,   -6,   25,   16,    9,
          8,   17,  -14,  -24,   -1,   -7,    8,    9,   -3,   -7,   -6,
          3,  -30,    5,    6,   -2,    6,   -2,  -28,   14,   -2,  -16,
         25,    5,   30,   10,   47,   -9,  -10,  -14,  -51,   -9,    4,
        -48,  -30,   38,   -2,   -6,  -25,    9,  -38,  -20,   24,  -21,
          2,   -4,  -32,  -37,   -7,  -21,    2,   -3,    9,   14,   17,
         26,  -27,    9,   -4,  -11,   19,   19,  -13,   -8,    6,  -29,
         22,  -33,   12,  -39,   -2,   -7,  -20,  -33,  -29,  -11,  -39,
        -13,    1,  -29,    3,   -7,    2,  -21,   -3,   13,    0,  -27,
        -21,   21,  -41,  -49,   15,    0,   22,   12,   10,  -21,   -3,
        -59,    9,   -1,    7,   -4,    0,  -11,  -43,  -20,   14,  -19,
          0,  -22,   -4,    8,   -2,   -5,   15,   19,    9,  -16,   -1,
         -8,   -3,    8,   30,    1,   -4,   -2,   -4,   22,    3,  -23,
         -9,    4,    7,   -4,  -10,    6,   -4,   -8,   10,    8,   11,
         12,   -8,    8,   -1,   -1,   20,    1,   51,   -2,   24,  -24,
         21,   -7,   22,   -4,  -23,  -16,   15,    6,   -2,   50,    2,
         28,   48,    7,   13,    1,  -13,   -3,  -22,    5,   27,    5,
         -7,   13,   11,   -9,    1,    5,  -26,  -15,    0,    3,  -15,
         -4,   -7,   -4,   23,   17,  -10,   -8,   15,   -3,  -18,   -3,
         14,    3,    8,  -29,   38,   23,   -1,    0,   -7,  -17,   -8,
          8,    7,   -7,   -8,   -2,  -17,  -11,   -5,    6,    7,  -25,
         -5,    1,  -15,   16,  -10,   -3,    3,  -43,   -4,   -3,   -2,
         13,    3,   31,   -4,  -29,   11,  -27,   -8,    7,   -1,   -6,
         31,   -3,   21,   21,    0,   20,   -1,    6,  -12,  -19,   -1,
         10,   -3,   -9,   17,   19,  -39,   10,  -12,    1,   20,  -35,
        -64,   12,  -10,  -31,   35,  -49,   41,    2,    0,  -33,  -30,
        -10,   -3,  -11,  -42,  -45,   -4,  -10,   11,   -1,   -7,  -25,
        -23,  -18], dtype=int8)
%classifier.2.weight, shape: [1, 1, 32, 8], exponents: [-6], docString: layout ==> N16HWC16_UNALIGNED, 
value: array([-34,  10, -26,  10,  32, -21,  13, -15,  68, -52,  31, -11, -57,
        51,  32,   1,   9,  22,  76,   9,  -2, -22, -74, -17,  17, -27,
       -12,  46,  17, -19,  48,  13,  17,  18,  42,  87,  28,  21, -23,
       -56,  -6,  17, -27,  22, -37,  -2, -30, -40, -45,  19,   1,  32,
        53,  74,  60,  78, -50, -24, -24, -24,  16, -35, -19,  -5, -58,
       -17, -27, -42,   9, -34,  -1, 104,  -9,   5, -23, -70,  34,  -9,
        19,  -4,  30,  -5,  11,  54,  63, -68, -42, -12, -22,  59,  53,
        55,  46,  48,   5,  64, -17, -53,  -9,  -6, -31,  -7,  27,  37,
       -25,  46,  -3,  46, -50, -45,  57, -30,  37,  51, -24, -15,  28,
         2,  58,  29, -13, -53,   3,  13,  38,  25,  26, -63,  53, -28,
         9, -31,  28, -53,  -1, -28,   2,  26, -56, -14,   9, -31, -18,
        34, -13,  36, -12,  16,  15,   5,  34, -96, -50,  56,  -7, -41,
       -54, -26, -63,  63,  18,  29,  29,  16, -18,   7,  -9, -21,  42,
        11,  62,  28,  39,  39, -63,  46,  -2, -40, -27, -66,   4,   8,
       -38, -31,  43, -39, -37,   7, -58, -34, -21,  27,  21,  -3,  31,
       -56, -68,  46, -67, -10, -42, -39,   0, -67,  28, -12,  52,  41,
       -19, -32, -40, -31,  -9, -71, -72,  10,   3,  12,  37, -22,  10,
        11, -19, -55,  19,  49, -25,  -4, -78,  20,  87,  37, -40,  84,
        33,  38, -19,  27,   7,  35, -44, -20,  58,  18, -38, -12,  52,
        59,  45,  56, -16, -21,  -5,  92, -20, -46], dtype=int8)
%classifier.2.bias, shape: [8], exponents: [-11], docString: layout ==> UNK, 
value: array([ -27,   -1, -269,  154,  139,  -40,   99,  -84], dtype=int32)
%onnx::Conv_173, shape: [3, 3, 192, 1], exponents: [-3], docString: layout ==> N16HWC16, 
value: array([ -6,   4,   8,  -5,  -7,  -6,   5,  12,   5,  -7,   3,   1,  -4,
        -3,   3,  -3,  -5,  -8,   5,  -2,  -8,  -5,   8,  11,   7,  -2,
         1,   1,  -3,  -2,   4,  -2,  -7,   4,   8,  -4,  -6,  -4,   9,
        14,   1,   5,   3,   1,  -3,  -3,  -6,  -3,  -8,   1,   5,  -2,
        -4,  -6,   8,   5,   6,   0,   3,   2,  -3,  -4, -10,  -1, -10,
        -8,   2,  -1,   0,  -1,   7,   6,   0,  -5,   1,   1,  -3,  -1,
        -7,   0,  -5,   4,   3,  -3,  -2,  -6,  10,   7,   2,   3,   2,
         1,  -4,  -3,  10,  -3,  -5,   1,   8,  -4,  -3,  -6,   7,   8,
         4,   8,   2,   1,  -2,  -4,   5,  -4,  -9,   4,   5,  -2,  -5,
        -7,   7,   8,   1,   2,   1,   1,  -4,  -3,   5,  -2,  -6,  -5,
         7,  -3,  -4,  -7,   9,  14,   5,   7,   2,   1,  -4,  -5,  -7,
        -5,   0,   4,  -2,   1,   3,  -2,  -3,  -3,  23,  -2,   3,   2,
         2,  -3,  -1,  -2,  -1,   1,  -2,   1,   2,   1,  -2,  -3,  13,
        -3,   4,   2,   1,  -3,   2,  -2,  -1,   2,  -2,   1,   4,   1,
        -4,  -2,  19,  -1,   5,   3,  -3,  -3,   2,  -2,   0,   0,  -1,
         2,   2,   0,  -1,  -3,  13,  -3,   4,   1,  -1,  -2,   2,  -2,
         0,  -5,   0,   1,   2,   1,   0,  -2,   7,   0,   1,   1,  -1,
        -2,   2,  -1,  -1,   1,  -1,   2,   1,   1,  -1,  -1,  11,  -1,
         3,   1,  -3,  -4,   1,  -2,  -1,   3,  -3,   2,   3,  -2,  -3,
        -3,  24,  -2,   5,   3,  -4,  -5,   2,  -3,  -1,   2,  -2,   2,
         2,  -5,  -2,  -2,  14,  -2,   4,   2,  -2,  -4,   2,  -2,  -6,
         3,  -2,   2,   3,  -2,  -3,  -1,  19,  -3,   6,   2,  -3,  -9,
         2,  -3,  -4,  -8,  -3,   3,   0,   2,  -6,  -1,   8,  -5,  -2,
        -1,   2,   8,  -5,  -4,  -2,  -4,   1,   1,   1,   0,   0,   0,
         6,  -8,  -2,  -5,  -4,   7,  -2,   0,  -3,  -2,   2,   2,  -5,
         2,   5,   1,   8,   3,  -2,  -1,   2,  11,  -5,   2,   0,  -2,
        -4,   2,  -3,   1,  -4,  -1,   3,  -5,  -1, -11,  -4,   6,  -6,
        -3,   2,  -3,   0,   0,  -2,  -1,   1,  -3,   3,  -8,   0, -13,
        -5,   6,   1,   1,   0,  -1,   1,   2,   5,   2,   3,   1,   4,
        -1,  -1,  -5,   0,   6,  -3,   2,  -3,  -1,  -1,   3,   3,   3,
        -7,  -5,   9,   1,  -2,   1,   1,   8,  -7,  -3,  -1,   1,  -4,
         1, -11,   1,   1,  -1,   7,  -1,  -2,  -4,   0,   6,  -1,   0,
        -2,   0,  -3,   4,   1,   3,   4,   1,   9,   0,  -2,   1,   1,
         7,  -4,   3,  -3,   3,  -7,   2,  -2,  -1,   2,   6,   6,   3,
        -4,  -6,  -5,   0,  23,   2,  -3,   3,  -4,   3,  -3,   5,  -3,
         4,   2,   4,  -2,  -3,  -3,  -4,   7,   1,  -1,   4,  -8,   2,
        -2,   3,  -4,   6,   1,   4,  -6,  -4,  -3,  -4,  29,   1,  -4,
         5,   8,   3,  -2,   1,   2,   3,   1,   1,   3,  -1,  -4,  -3,
        18,   1,  -3,   5,   7,   2,  -1,   7,  -1,   3,   4,   1,   2,
         0,   1, -10,   5,   1,  -8,   6,   6,   1,  -2,   6,  -1,   4,
         1,   4,   0,  -3,   3,  -8,  16,   1,  -5,   4,  -8,   2,  -4,
         0,   2,   9,   4,  -4,   3,   5,  -4,   0,  27,   2,  -5,   6,
        -5,   1,  -2,   7,  -4,   4,   3,  -3,   2,   2,   1,  -5,  10,
         1,  -9,   4,  -7,   3,  -4,   5,  -3,   6,   5,  -4,   2,  -5,
         3,  -6,  31,   2,  -3,  -3,  -2,   1,   2,   3,   4,   7,   3,
         2,   0,   6,   4,  -2,  -4,  -4,  -1,  -2,  -2,   4,   1,   2,
         3,   9,   1,  -3,  -4,   3,   2,  -3,   6,   0,  -4,  -2,  -3,
         3,   2,   3,   3,  10,   3,  -3,  -4,   5,   2,  -3,  11,  -3,
         0,  -2,   2,   4,   2,   2,   3,  12,   4,   0,   1,   1,   4,
         0,   6,  -1,   2,   0,   2,   5,   0,   1,   1,  12,   1,  -6,
        -3,  -1,   2,  -2,   4,   2,   0,   0,   1,   3,   2,   2,   3,
        13,   4,  -1,  -2,   3,   4,  -3,   3,  -1,  -4,  -3,   5,   2,
         2,   2,   3,  14,   6,   2,   1,   7,   6,   3,  11,  -4,  -1,
        -2,   5,   4,   1,   2,   2,  14,   3,  -2,   0,   4,   3,   0,
        10,   1,  -3,  -3,   4,   1,   2,   1,   5,  13,   5,   4,   1,
         7,   5,  -3,  13,  -4,  -4,  -4,  -2,  -2,   6,   3,   4,   3,
        -2, -10,  -5,   4,   5,  11,   3,   0,  -2,   0,  -1,  -1,   3,
         4,  -2,   2,   1,  -3,  -7,  -5,   5,   8,   4,  -2,   1,  -5,
         0,  -2,   6,   4,  -6,   1,  -1,  -7,  -4,   6,   4,   5,   3,
        -2,  -3,   2,  -2,  -3,   3,   4,  -7,   1,  -2,  -2,  -2,   4,
         6,   8,   2,  -2,   0,   5,   0,  -2,   2,   2,  -3,   1,  -1,
         3,  -1, -10,   4,  -2,   3,  -2,   0,   2,  -2,  -1,   6,   4,
        -1,   2,  -1,  -1,  -2,   3,   5,   0,   4,  -1,  -4,   1,  -4,
        -4,   8,   5,  -5,   1,  -2, -10,  -3,   5,   6,  11,  -3,  -3,
        -1,   4,  -3,  -2,   3,   3,   0,   1,  -2,  -5,  -7,  -7,   6,
         5,  -1,  -1,   1,   2,  -4,  -2,   8,   5,   3,   2,  -2,  -8,
        -3,   6,   5,   7,  -1,   0,   5,   2,  -1,  -3,   4,   3,   5,
         4, -20,   3,   0,  -1,   8,  -3,  -4,  -6,   3,   1,  -5,  -5,
         3,  -2,   5,   2,  20,   4,  -2,  -3,   7,  -1,  -4,  -6,   4,
         2,  -7,   1,   4,  -4,   4,   3,   2,   5,  -3,  -4,   7,  -2,
        -5, -12,   2,   1,   1,   0,   3,   1,   3,   2,  10,   8,   0,
        -3,   8,  -2,  -9,  -5,   1,   0,  -1,  -2,   3,  -3,   4,   2,
        13,   6,  -2,  -2,   6,   0,  -3,   3,   4,   1,   1,   2,   2,
        -5,   4,   1,  13,  10,  -3,  -3,   9,  -1,  -8,   1,   7,   2,
         2,   4,   2,   2,   4,  -6,  20,   5,   0,  -3,   7,  -3,  -5,
        -8,   5,   1,   1,   1,   1,  -2,   4,  -1,  23,   5,  -2,  -3,
         5,  -4,  -7,  -3,   7,   2,   2,   4,   2,   0,   5,  -6,  15,
         6,  -3,  -4,   9,  -5,  -9, -11,   2,  -8,   0,   7,  -4,   6,
         5,  -6,  -3,   3,  -3,  26,   4,   3,   4,  -2,   2,   2,  -7,
         7,  -4,   2,   3,  -4,   0,   1,  -2,  17,   1,   4,   1,  -2,
         2,  -9,   0,   5,  -3,   3,   5,  -6,  -4,   2,  -2,  32,   3,
       -14,  -4,  -3,   2,   0,   3,   3,  -2,   3,   4,  -2,   0,   2,
        -2,  19,   2,   4,   2,  -1,   3,   4,  -3,   2,  -3,   1,   4,
        -1,   3,   1,  -1,   8,   0,   6,   0,   0,   4,   1,  -2,   7,
         2,   0,   3,  -5,  -1,   2,  -1,  22,   2,   6,  -3,  -1,   0,
         2,   4,   3,   2,   4,   4,   2,  -4,   3,  -1,  28,   4, -10,
        -3,  -3,   3,   5,  -1,   6,   2,   2,   4,   1,  -2,   1,  -1,
        14,   2, -11,  -4,  -1,  -1,  -5,  -3,   6,   1,   5,   5,   3,
        -4,   2,  -2,  35,   4,   1,  -4,  -1,   6,  -2,  -3,   4,  -2,
        -7, -11,   7,   1,   5,   4,  -1,  -5,   8,  -2,   6,   3,  -1,
        -1,   1,  -2,  -5,  -5,   1,   2,   4,   3,  -6,   2,   1,  -3,
        10,   6,   1,  -3,   4,  -1,  -7,  -7,  -6,   2,   2,   6,   0,
        -5,   4,  -3,   9,   0,  -2,  -2,   0,  -3,  -7,   8,  -6,   3,
         5,   7,  -1,  -1,   2,  -2,   4,   1,  -2,   1,   1,  -2,  -5,
         8,  -2,   3,   5,   7,   0,   1,   1,  -1,   5,   0,  -3,  -1,
         2,  -2,  -4,  -2,  -1,   3,   4,  11,  -2,   0,   4,  -2,  10,
        -7,  -2,  -3,  -5,  -2,  -8,  -8,   2,   2,   1,   7,  -1,  -4,
         8,  -3, -11,  -4,  -2,   0,  -4,  -1,  -6,  -5,  -6,   2,   6,
         6,  -1,   0,   5,  -3,  -5,  -7,  -3,  -3,  -4,   0,  -7,   6,
         6,   3,   3,   9,  -1,  -4,   5,  -3,  -9,   3,   7,  -2,  -2,
        -5,   2,   1,  -6,  54,  -2,   1,  -2,   1,  -4,  -4,   2,  -6,
         4,  -3,  -1,  -4,   1,   2,  -7,  72,  -2,  -5,  -2,   2,  -1,
        -3,   2,   2,   5,  -1,  -1,  -1,   1,   3,  -8,  68,  -2,  -8,
         1,   2,   2,  -3,   2,  -7,   3,  -7,  -2,   0,   2,   0,  -3,
        48,  -1,  -5,  -2,   2,  -4,  -4,   2,   4,  -1, -13,  -1,  -3,
         2,   1,  -4,  55,  -1, -11,  -1,   2,  -2,  -1,   1,   4,   0,
       -10,  -2,   1,   2,   2,  -3,  46,  -1,  -9,  -2,   2,   0,  -4,
         1,  -1,   8,   2,  -2,   0,   2,   1,  -4,  43,  -2,  -4,  -3,
         2,  -1,  -4,   1,   7,   4,  -3,  -2,  -1,   3,   1,  -4,  68,
        -2,  -8,  -2,   1,  -1,  -4,   1,  -7,   7,  -1,  -2,  -1,   2,
         3,  -8,  55,  -3,  -6,  -3,   2,   1,  -4,   3,  -4,  -4,   4,
        -2,   2,  -3,   3,  -3,  12,   3,  -3,  -2,   3,  -5,  -4,   5,
        -2,  -4,   3,  -2,   1,  -4,   0,  -1,  15,   2,  -3,  -2,   3,
        -4,  -1,   2,  -4,  -2,   3,  -2,   2,  -3,   3,  -2,  15,   4,
        -4,  -3,   3,  -4,  -3,   4,  -2,  -2,   5,  -2,   2,  -9,   0,
        -5,  10,   3,  -4,  -1,   4,  -5,   0,   2,  -1,   0,   4,   0,
         1,  -2,  -2,  -2,  11,  -5,  -4,   1,   3,  -3,   1,   1,  -1,
        -2,   5,  -1,   3,  -6,  -6,  -3,  12,  -3,  -6,  -1,   4,  -4,
         0,   2,  -1,  -4,   9,  -3,   2,  -5,   3,  -1,   9,   4,  -2,
        -2,   4,  -6,  -3,   4,   1,  -2,   7,  -2,   2,  -4,  -2,   0,
        12,  -5,  -3,  -2,   4,  -3,  -1,   3,   2,   0,   7,  -2,   2,
        -4,  -8,  -2,  13,   6,  -5,  -2,   4,  -2,  -3,   3,  -3,   2,
        -5,   6,  -2,  -1,   2,  -2,   3,   6,  -1,  10,  -9,   1,  -1,
        -3,  -1,  -3,   7,   0,  -6,  -3,  -1,  -3,   1,   5,   5,   4,
         3,   2,   5,   0,  -3,  -3,   8,  -4, -10,  -2,  -4,  -2,   1,
         8,  -4,   9,   3,   3,   0,  -1,   0,   0,  -3,   2,  -2,   0,
         2,  -1,   2,   4,   6,   4,  -2,   2,   3,  -3,   2,  -4,   3,
         5,  -3,  -2,   4,   0,   3,   5,   6,   0,  -6,   2,   4,  -3,
        -1,  -4, -11,  -3,  -6,  -2,   2,  -1,   3,   5,   5,   3,  -8,
         1,  -1,  -2,  -3,   2,   7,  -1,  -5,  -4,   1,  -3,   3,   5,
         5,   9,   5,   1,   1,  -2,  -3,  -3,  10,   5,  -5,  -5,   5,
        -1,   1,   6,   7,   3,  -2,   2,   3,  -1,  -5,   2, -15,   4,
        -4,  -1,   4,  -3,   2,   8,   5,  11,   5,   2,   0,  -4],
      dtype=int8)
%onnx::Conv_164, shape: [3, 3, 144, 1], exponents: [-4], docString: layout ==> N16HWC16, 
value: array([ -4,  -8,  -3,  -4,  -7,  -5,  -1,   3,   0,   0,  -7,   2,  -8,
        -2,   3,   2,   0,  -1,  -3,  -7,  12,   3,  -4,   3,  -8,   3,
        -5,   4,  -1,   2,  10,  -4,  -3,  -1,  -4,   1,   5,   4,  -4,
         1,  -7,   4,  -1,   1,   0,   1,   9,  -2,  -2,  -3,  -3,   3,
         7,   5,  -4,   0,  -7,   2,  -2,   6,  -5, -17,  10,  -6,  -4,
         1,   1,  -2,   7,  13,  -2,  -4,  -5,   1,  -4,   3,   0, -12,
        12,  -3,  -7,  -1,  -4,  -2, -14,   9,  -1,   0, -11,   3,  -2,
         4,  -4, -13,   9,  -3,  -8,  -8,  -3,  -9,   3,   7,  -1,  -7,
        -6,   2,  -1,   1,   1,   5,   4,  -1, -10,   0,  -2,  -4,  -6,
         5,  -3, -10, -15,   2,  -1,   3,  -6,   3,   8,  -7,  -7, -12,
        -5,  -3, -21,  -4,  -1,  -7,  -6,   1,  -2,   5,  -1,   5,   3,
        -4,  -5,   0,  10,  -3,  -6,   1,   1,  -4,   0,   0,   6,   6,
       -18,   3,   3,  11, -12,  -3,   6,  -3,  -5,   2,   5,  -4,  -3,
         5,  -4,  10, -10,   6,   5,   7,  -9,  -4,   3,  -3,  -8,   2,
         3,  -4,  -4,   2,  -8,   5,   1,   2,   4,   6,  -4,  -1,   8,
         0,  -4,   7,   4,   0,  -3,   1,   4,  -3, -10,   4,   6,   7,
        -2,  -7,   7,   2,  -9,   9,   5,  -3,   2,   9,  -7,   2,   3,
         8,  12,  -3,  -8,  -4,   4,  -2,  -2,   4,   6,  -6,  -3,   6,
        -1,   3,  13,   6,   6,   4,  -1,  -3,   1,  -9,  -6,   2,   6,
         3,  -6,   3,  -7, -14,  -1,   3,   5,   7,   0,  -5,   3,  -2,
        -3,   5,   9,   1,   1,   3,  -5, -10,   8,   7,   6,   3,  -3,
         0,   2,  -1,   1,   3,  10,  -1,  -5,   3,   5,  -3,  10,   6,
         6,  12,   1,   1,   2,   4,  -4,   5,  -6,   4,  -8,  14,  -5,
        -2,   2,  -1,  -6,   1,   4,  -6,  -5,   6,  -3,   2,  -3,   6,
         3,  -5,  -8,  -3,   7,  -4, -20,  -7,   4,  -5, -15,   3,  -6,
         3,   0,   8,  10, -14,  -6,   2,   2,  -4,  -5,  -5,   6,   2,
        -3,   3,  -1,   6, -10,   4,   5,   8,  -2, -12,   5,  -2,   1,
        -1,   7,  -6, -12,   2,  -1,   3,  -1,   4,   8,  -4,  -1,   3,
         7,  -4,   4,  -1,   7,  -6,  -6,   6,  -2,   4,   5,   8,  10,
       -14,   2,   4,   2,  -2,  -2,  -5,   4,   0,  -7,   5,  -5,   2,
        -7,   6,   5,   9,  -5, -16,   4,  -2,  -3,  -8,   5,   2, -11,
         5,  -2,   2,   3,   8,  11,   4,  -1,   5,   3,  -3, -10,  -3,
         3,   1,  -5,   3,  -4,   4,   7,   3,   5,  -3,  -3,   2,   3,
        -2,  -3,  -3,   0,  -6,   4,   3,   1,  -2,  -3,  -9,   3,  -2,
         2,   6,  -3,   8,   0,   1,  -7,  -6,   7,  10,  -8,  -4,  -7,
        -7,   6,   6,   5,   6,   1,  21,  -1,   8,  -6,  -2,   3,   3,
        -7,  -5,   1,  -1,   2,   9,   3,   6,  -2,  28,  -2,   6,   0,
        -4,   5,  13,   0,  -3,  -2,  -6,   7, -12,   7,   1,  -3,  18,
         7,  -4,  -3,   0,   8,  19, -13,  -3,  -7,  -3,   4,  -6,   9,
        -2,   2,  14,   4,   1,  -1,  -4,   7,   9,   2,  -4,  -9,   1,
         2,   7,   6,  -1,  -6,  19,   2,   5,  -2,   1,   5,   5,   0,
        -7, -10,   0,   5, -11,   4,  -2,  -1,  18,   4,  -7,  -3,  -7,
         4,  18,   1,  -6, -10,   2,   3,  -4,   5, -12,  -4,  17,   7,
         2,  -5,   0,   4,  14,   3,  -7,  -8,   1,   2,   3,   4, -13,
        -5,   8,   1,   6,   9,  -3,  -4,   1,   1,  -2,  -6,  -4,  -7,
        -5,  -2,  -6,  -1,  -6,   4,  -4,   9,  -3,  -4,   6,   6,  -5,
        -3,   8,   4,  -3,  -4,  -2,   2,  -5,   3,  -3,   4, -11,  -5,
        10,   2,  -7,   0,   3,   1,  -1,  -3,  -6,   1,  -4,   3,   4,
         9,  -9,  -1,   7,   7,  -1,  -7, -12, -10,  -2,  -2,  -5,   5,
        -2,   5,  -8,   6, -10,  -2,   2,  12,  -7,  -4,   6,  -1,  -6,
        -5,  -3,   9,  -5,   3,  -7,  10, -11,  -4,   8,   6,   0,   2,
         6,   2,  -5,  -2,  -2,   3,  -2,   3,   0,   3,  -7,  -4,   5,
         4,  -1,  -3, -12,  -4,  -1,  -2,  -4,   4,   0,   4,   0,  14,
        -9,   0,   7,   6,  -2,  -2,  -4, -11,  -4,  -6,  -3,   5,  -3,
         5,  -2,   8, -12,   0,   7,   4,  -1,   4,   1,  -7,  -2,  -1,
         7,  -1,  -1,   2,   2,  -1,  32,   1,   8,   4,   2,   0,  -5,
         3,   5,   2,   3,   7, -10,   1,   2,   4,  19,   2,  13,   4,
         5,   3,  -1,  14,   3,   0,   5, -12,  -7,  -6,  13,   0,  12,
         4,  11,   1,   0,   3,  -3,   4,  -8,   2,   5,  -5,   0,  -3,
         8,   7,  32,   2,  15,   9,   6,   2,   0,  16,  15,   3,   9,
        -6, -11,   0, -10,  10,  44,   2,  11,   8,  19,   7,  -2,  19,
        15,   3,   1, -18,  -2,  -7,  17,   8,  44,   4,  18,   5,   7,
         7,  -2,  10,  10,   3,   4,  -1,   8,  -2,  14,   3,  17,   1,
         7,   4,   5,   1,  -4,  14,   6,   4,   4, -11,  -7,   0,   0,
         1,  62,   2,   9,   6,  11,   3,  -3,  17,  14,   5,   7, -12,
         3,  -4,   2,   7,  27,   2,  12,   3,  -1,   3,  -4,  -6,  18,
         3,   2,   7,   5,  -1,   6,  -3, -12,   3,   3,   3,  -2,   3,
         5,   4, -11,  -7,   2,   5,   1,   5,   2,   0,  -5,   3,   4,
        -6,   3,  10,   2,   6,  -3, -10,   4,   8,   3,   7,   4,   2,
         0,   4,   4,  -4,  -1,   8,  -1,   3,   1,  -6,   6,  10,   3,
         4,   2,  -5, -15,   4,   3,  -1, -13,   9,  12,   1,   1,  -8,
         2,   6,   3,   2,   3,  -2,  -1,  10,  -1,  -3,   0,   7,   1,
        -3,  -3,  -5,   0,  16,   3,   3,   6,   1,   7,   7,   2,  -2,
         3,   8,  -1,  -3,   0,  -5,   5,  12,   4,   4,   5,  -3,  -1,
         1,   3,  -4,  -8,   4,   8,  -7,   2,  -7,   5,   3,   2,   2,
        -1,  -3,   4,   5,   4,  -3,   1,   3,   2,  -6,  -8,  -9,   4,
         9,   4,   2,   2,  -4,   9,   5,   2,   1,   2,   5,  -4,  -9,
        -3, -10,   6,   5,   1,   5,   3, -10,  -1,   0,  14,   3,   2,
         5,  -3,  -2,  -2,  -3,  -3,   2,  -1,  -1,  -1,  -4,  -5,  -6,
        20, -10,   5,   6,  -2,  -3,  -2,  -5,  -3,   3,  -2,  -3,  -6,
        -8,  -3, -11, -25,  -4,   6,   2,  -3,  -2,  -4,  -5,  -4,   3,
        -2,   1,   0,  -6,  -5, -14,   1,   0,   1,   4,  -1,  -8,   0,
        -3,  -1,   4,  -2,  -5,  -4,  -3,  -9,  -2,  11,  -1,   3,   4,
        -4,   0,  -3,  -1,  -5,   5,  -4,  -4,  -3,  -4,  -8,   0,  14,
       -10,   8,   3,  -1,  -1,  -3,  -1,  -7,   4,  -1,  -6,  -1,  -8,
        -3,   0, -35,   2,  10,   2,  -3,  -7,  -2,  -1,  -4,   3,  -5,
        -2,  -1, -14,  -8,   7,  -3,   2,   5,   4,   0,   2,  -4,  -7,
         0,   4,  -3,  -6,  -4, -11,  -9,   7,  16,  -4,   9,   4,  -4,
         3,  -2,  -3,  -3,   5,  -2,  -1,   0,   0,   2,   6,   6,  -5,
       -25,  -3,   5,   2,   1,   2,   1,  -5,  56,  -8,   3,  -2,   4,
         4,   6, -16,   2,  -3,  10,  19,   1,  -1,  -2, -12,  58,  -6,
         6,  -3,   2,   8,   1,  -3,   4,  -2,   4,  19,   3,  -7,  -2,
       -15,  28,  -3,   3,  -4,   3,   9,   2,  -3,  -7,   0,   6,  13,
        -9,   1,  -5,   4,  95,   0,   5,  -2,   4,  10,  -5,   0,  10,
        -3,   7,  20,  -4,  -7,  -4,  -4,  78,  -3,   7,  -3,   3,  10,
        -7,   3,   3,  -3,  10,  15,  -1,   2,  -5,  -3,  82,  -1,   4,
